#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
1/providers/Microsoft.Network/networkInterfaces/ts-p-itn-subscription-fn-staging-pep-01.nic.bcf9ecd8-b4b1-4d60-85ba-5c3f2b0d9421"
              - name = "ts-p-itn-subscription-fn-staging-pep-01.nic.bcf9ecd8-b4b1-4d60-85ba-5c3f2b0d9421"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-staging-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01-staging.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.8",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01-staging.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.8",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01-staging.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-staging-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-subscription-fn-staging-pep-01" -> "ts-p-itn-subscription-fn-staging-endpoint" # forces replacement
          ~ private_ip_address             = "10.30.2.8" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.commons.module.apim_trial_manager_api_v1.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "ts-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "TRIAL MANAGER API"
      + display_name          = "TRIAL Manager API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "trial-manager-api"
      + path                  = "manage/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "ts-p-itn-routing-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  version: 0.0.0
                  title: Trial System API
                  description: |
                    Endpoint of Trial System.
                servers:
                  - url: https://api.trial.pagopa.it/api/v1
                security:
                  - ApiKeyAuth: []
                paths:
                  /trials/{trialId}/subscriptions/{userId}:
                    get:
                      operationId: getSubscription
                      summary: Get subscription detail
                      description: >-
                        Returns the details about the subscription of the specified user for
                        the specified trial.
                      parameters:
                        - $ref: '#/components/parameters/pathTrialId'
                        - $ref: '#/components/parameters/pathUserId'
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Subscription'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Not Found
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                  /trials/{trialId}/subscriptions:
                    post:
                      operationId: createSubscription
                      summary: Create a subscription
                      description: Subscribe the given user to the given trial.
                      parameters:
                        - $ref: '#/components/parameters/pathTrialId'
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateSubscription'
                      responses:
                        '201':
                          description: Created
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Subscription'
                        '202':
                          description: Accepted
                        '400':
                          description: Bad Request.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Not Found
                        '409':
                          description: Conflict
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                  /trials/{trialId}/activation-job:
                    parameters:
                      - $ref: '#/components/parameters/pathTrialId'
                    get:
                      operationId: getActivationJob
                      description: Get the activation job for the given trial
                      summary: Get the activation job
                      responses:
                        '200':
                          description: The activation job
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ActivationJob'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Not Found
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                    put:
                      operationId: updateActivationJob
                      description: Update an activation job
                      summary: Update an activation job
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/UpdateActivationJob'
                      responses:
                        '200':
                          description: The activation job
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ActivationJob'
                        '400':
                          description: Bad Request
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Not Found
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                    post:
                      operationId: createActivationJob
                      description: Create the job to activate users for a given trial
                      summary: Create the activation job
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateActivationJob'
                      responses:
                        '202':
                          description: Accepted
                        '400':
                          description: Bad Request
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Trial not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                  /trials:
                    post:
                      operationId: createTrial
                      description: Create a trial
                      summary: Create a trial
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateTrial'
                      responses:
                        '202':
                          description: Accepted
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Trial'
                        '400':
                          description: Bad Request
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        '401':
                          description: Unauthorized
                        '409':
                          description: Conflict
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                  /trials/{trialId}:
                    get:
                      operationId: getTrial
                      description: Get trial by id
                      summary: Get a trial
                      parameters:
                        - $ref: '#/components/parameters/pathTrialId'
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Trial'
                        '401':
                          description: Unauthorized
                        '404':
                          description: Not Found
                        '500':
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  parameters:
                    pathTrialId:
                      name: trialId
                      in: path
                      required: true
                      schema:
                        type: string
                        minLength: 1
                    pathUserId:
                      name: userId
                      in: path
                      required: true
                      schema:
                        # Using the reference ($ref) to UserId breaks the client generator
                        # For now duplicate the type
                        type: string
                        minLength: 1
                    pathActivationJobId:
                      name: activationJobId
                      in: path
                      required: true
                      schema:
                        type: string
                        minLength: 1
                  schemas:
                    ProblemJson:
                      $ref: 'https://raw.githubusercontent.com/pagopa/io-functions-commons/v29.0.0/openapi/definitions.yaml#/ProblemJson'
                    ApplicationInfo:
                      type: object
                      properties:
                        message:
                          type: string
                      required:
                        - message
                    CreatedAt:
                      $ref: 'https://raw.githubusercontent.com/pagopa/io-functions-commons/v29.0.0/openapi/definitions.yaml#/Timestamp'
                    UpdatedAt:
                      $ref: 'https://raw.githubusercontent.com/pagopa/io-functions-commons/v29.0.0/openapi/definitions.yaml#/Timestamp'
                    UserId:
                      type: string
                      minLength: 1
                    SubscriptionState:
                      type: string
                      description: |-
                        - UNSUBSCRIBED: The user is not subscribed to the specified trial and does
                            not have any access to the specified trial.
                        - SUBSCRIBED: The user is subscribed to the specified trial and does
                            not have any access to the specified trial. The system is going to
                            activate the user if any slot for the trial is available.
                        - ACTIVE: The user has the access to the specified trial.
                        - DISABLED: The user does not have the access to the specified trial.
                      enum:
                        - UNSUBSCRIBED
                        - SUBSCRIBED
                        - ACTIVE
                        - DISABLED
                    CreateSubscriptionState:
                      type: string
                      description: |-
                        - ACTIVE: The user has the access to the specified trial.
                      enum:
                        - ACTIVE
                    TrialId:
                      type: string
                      description: Unique identifier of the trial.
                      minLength: 1
                    TrialName:
                      type: string
                      description: The name of the trial
                      minLength: 1
                    TrialDescription:
                      type: string
                      description: The description of the trial
                    UsersToActivate:
                      type: integer
                      minimum: 1
                      format: int32
                      description: The total number of users to activate
                    CreateSubscription:
                      description: >
                        Payload to create a subscription.
                        If the `state` property is not provided, the subscription will have the
                        `SUBSCRIBED` state. Otherwise, the subscription will be created with the
                        provided state.
                      type: object
                      required:
                        - userId
                      properties:
                        userId:
                          $ref: '#/components/schemas/UserId'
                        state:
                          $ref: '#/components/schemas/CreateSubscriptionState'
                    Subscription:
                      type: object
                      required:
                        - trialId
                        - userId
                        - state
                        - createdAt
                        - updatedAt
                      properties:
                        trialId:
                          $ref: '#/components/schemas/TrialId'
                        userId:
                          $ref: '#/components/schemas/UserId'
                        state:
                          $ref: '#/components/schemas/SubscriptionState'
                        createdAt:
                          $ref: '#/components/schemas/CreatedAt'
                        updatedAt:
                          $ref: '#/components/schemas/UpdatedAt'
                    CreateActivationJob:
                      type: object
                      required:
                        - usersToActivate
                      properties:
                        usersToActivate:
                          $ref: '#/components/schemas/UsersToActivate'
                    UpdateActivationJob:
                      type: object
                      required:
                        - usersToActivate
                      properties:
                        usersToActivate:
                          $ref: '#/components/schemas/UsersToActivate'
                    ActivationJob:
                      type: object
                      required:
                        - trialId
                        - usersToActivate
                        - usersActivated
                      properties:
                        trialId:
                          $ref: '#/components/schemas/TrialId'
                        usersActivated:
                          type: integer
                          format: int32
                          minimum: 0
                          description: The total number of activated users
                        usersToActivate:
                          $ref: '#/components/schemas/UsersToActivate'
                    SubscriptionEvent:
                      type: object
                      required:
                        - trialId
                        - userId
                        - state
                        - updatedAt
                      properties:
                        trialId:
                          $ref: '#/components/schemas/TrialId'
                        userId:
                          $ref: '#/components/schemas/UserId'
                        state:
                          $ref: '#/components/schemas/SubscriptionState'
                        updatedAt:
                          $ref: '#/components/schemas/UpdatedAt'
                    CreateTrial:
                      type: object
                      required:
                        - name
                      properties:
                        name:
                          $ref: '#/components/schemas/TrialName'
                        description:
                          $ref: '#/components/schemas/TrialDescription'
                    TrialState:
                      type: string
                      description: |-
                        - CREATING: The Trial System is creating the resources related to the trial.
                          The configuration is not yet completed.
                        - CREATED: The Trial System created the resources for the trial.
                      enum:
                        - CREATING
                        - CREATED
                    Trial:
                      type: object
                      required:
                        - id
                        - name
                        - state
                      properties:
                        id:
                          $ref: '#/components/schemas/TrialId'
                        name:
                          $ref: '#/components/schemas/TrialName'
                        description:
                          $ref: '#/components/schemas/TrialDescription'
                        state:
                          $ref: '#/components/schemas/TrialState'
                          description: The current state of the trial.
                        channel:
                          type: object
                          description: The channel used to connect and receive events.
                          properties:
                            azure:
                              type: object
                              description: Details for Azure channel integration.
                              required:
                                - queueName
                                - identityId
                              properties:
                                queueName:
                                  type: string
                                  description: The name of the queue where events are sent.
                                  minLength: 1
                                identityId:
                                  type: string
                                  description: The identity ID used to receive events from the queue.
                                  minLength: 1
            EOT
        }
    }

  # module.commons.module.apim_trial_manager_api_v1.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "ts-p-itn-apim-01"
      + api_name            = "trial-manager-api"
      + id                  = (known after apply)
      + resource_group_name = "ts-p-itn-routing-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{ts-subscription-fn-url}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{ts-subscription-fn-key}}</value>
                    </set-header>
                    <set-header name="x-user-id" exists-action="override">
                        <value>@(context.User.Id)</value>
                    </set-header>
                    <set-header name="x-user-groups" exists-action="override">
                        <value>@(String.Join(",", context.User.Groups.Select(g => g.Name)))</value>
                    </set-header>
                    <set-header name="x-subscription-id" exists-action="override">
                        <value>@(context.Subscription.Id)</value>
                    </set-header>
                    <set-header name="x-user-email" exists-action="override">
                        <value>@(context.User.Email)</value>
                    </set-header>
                    <cors>
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                        <expose-headers>
                            <header>*</header>
                        </expose-headers>
                    </cors>
                </inbound>
                <outbound>
                    <base />
                </outbound>
                <backend>
                    <base />
                </backend>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.commons.module.apim_trial_manager_api_v1.azurerm_api_management_product_api.this["ts-manager-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "ts-p-itn-apim-01"
      + api_name            = "trial-manager-api"
      + id                  = (known after apply)
      + product_id          = "ts-manager-api"
      + resource_group_name = "ts-p-itn-routing-rg-01"
    }

  # module.commons.module.cosmosdb_account.azurerm_cosmosdb_account.this must be replaced
-/+ resource "azurerm_cosmosdb_account" "this" {
      ~ automatic_failover_enabled                   = true -> (known after apply)
      ~ connection_strings                           = (sensitive value)
      ~ create_mode                                  = "Default" -> (known after apply)
      ~ enable_multiple_write_locations              = false -> (known after apply)
      ~ endpoint                                     = "https://ts-p-itn-cosno-01.documents.azure.com:443/" -> (known after apply)
      ~ free_tier_enabled                            = false -> (known after apply)
      ~ id                                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-cosno-01" -> (known after apply)
      ~ minimal_tls_version                          = "Tls12" -> (known after apply)
      + mongo_server_version                         = (known after apply)
      ~ multiple_write_locations_enabled             = false -> (known after apply)
      ~ name                                         = "ts-p-itn-cosno-01" -> "ts-p-itn-trial-account-01" # forces replacement
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      ~ primary_readonly_sql_connection_string       = (sensitive value)
      ~ primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://ts-p-itn-cosno-01-italynorth.documents.azure.com:443/",
          - "https://ts-p-itn-cosno-01-germanywestcentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ secondary_readonly_sql_connection_string     = (sensitive value)
      ~ secondary_sql_connection_string              = (sensitive value)
        tags                                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ write_endpoints                              = [
          - "https://ts-p-itn-cosno-01-italynorth.documents.azure.com:443/",
        ] -> (known after apply)
        # (14 unchanged attributes hidden)

      - analytical_storage {
          - schema_type = "WellDefined" -> null
        }

      ~ backup {
          ~ interval_in_minutes = 0 -> (known after apply)
          ~ retention_in_hours  = 0 -> (known after apply)
          + storage_redundancy  = (known after apply)
          ~ tier                = "Continuous30Days" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ consistency_policy {
          - max_interval_in_seconds = 5 -> null
          - max_staleness_prefix    = 100 -> null
            # (1 unchanged attribute hidden)
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "ts-p-itn-cosno-01-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "ts-p-itn-cosno-01-germanywestcentral" -> null
          - location          = "germanywestcentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "germanywestcentral"
          + zone_redundant    = false
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "543e20d3-377e-4cef-af72-fa9c7d2fa0ac" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.commons.module.cosmosdb_account.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Insights/metricAlerts/[TS-TRIAL | ts-p-itn-cosno-01] Provisioned Throughput Exceeded" -> (known after apply)
      ~ name                     = "[TS-TRIAL | ts-p-itn-cosno-01] Provisioned Throughput Exceeded" -> "[TS-TRIAL | ts-p-itn-trial-account-01] Provisioned Throughput Exceeded" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-cosno-01",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

        # (1 unchanged block hidden)
    }

  # module.commons.module.cosmosdb_account.azurerm_private_endpoint.sql[0] must be replaced
-/+ resource "azurerm_private_endpoint" "sql" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-cosno-pep-01" -> (known after apply)
      ~ name                     = "ts-p-itn-cosno-pep-01" -> "ts-p-itn-trial-cosmosdb-account" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-cosno-pep-01.nic.3c2c3417-0356-40d5-b016-243fbff8fabc"
              - name = "ts-p-itn-cosno-pep-01.nic.3c2c3417-0356-40d5-b016-243fbff8fabc"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-cosno-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-cosno-01.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.16",
                        ]
                      - name         = "ts-p-itn-cosno-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-cosno-01-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.17",
                        ]
                      - name         = "ts-p-itn-cosno-01-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-cosno-01-germanywestcentral.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.19",
                        ]
                      - name         = "ts-p-itn-cosno-01-germanywestcentral"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                     = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-cosno-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-cosno-psc-pep-01" -> "ts-p-itn-trial-cosmosdb-account-private-endpoint" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-cosno-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.30.2.16" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.commons.module.cosmosdb_sql_database_trial.azurerm_cosmosdb_sql_database.this must be replaced
-/+ resource "azurerm_cosmosdb_sql_database" "this" {
      ~ account_name        = "ts-p-itn-cosno-01" -> "ts-p-itn-trial-account-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-cosno-01/sqlDatabases/db" -> (known after apply)
        name                = "db"
      ~ throughput          = 0 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"                            = "activations"
          - "ACTIVATION_CONSUMER"                                            = "on"
          - "ACTIVATION_MAX_FETCH_SIZE"                                      = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                = "5"
          - "ActivationConsumerCosmosDBConnection__accountEndpoint"          = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01"
          - "COSMOSDB_DATABASE_NAME"                                         = "db"
          - "COSMOSDB_ENDPOINT"                                              = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"                     = (sensitive value)
          - "EVENTHUB_NAMESPACE"                                             = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                                = "on"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                                   = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                                        = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                            = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                               = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                    = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                              = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                        = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                 = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                                       = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"                             = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
          - "NODE_ENV"                                                       = "production"
          - "SERVICEBUS_NAMESPACE"                                           = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                                           = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                                = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                                              = "ProductionTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"                   = "subscription-history"
          - "SUBSCRIPTION_ID"                                                = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"                             = "ts-p-itn-sr-evh-01"
          - "SubscriptionHistoryCosmosConnection__accountEndpoint"           = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "SubscriptionRequestEventHubConnection__fullyQualifiedNamespace" = "ts-p-itn-main-evhns-01.servicebus.windows.net"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          - "TRIAL_CONSUMER"                                                 = "on"
          - "TrialsCosmosConnection__accountEndpoint"                        = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                = "1"
          - "WEBSITE_DNS_SERVER"                                             = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                       = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01"
        name                                           = "ts-p-itn-subscription-async-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"                            = "activations"
          - "ACTIVATION_CONSUMER"                                            = "on"
          - "ACTIVATION_MAX_FETCH_SIZE"                                      = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                = "5"
          - "ActivationConsumerCosmosDBConnection__accountEndpoint"          = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01-staging"
          - "COSMOSDB_DATABASE_NAME"                                         = "db"
          - "COSMOSDB_ENDPOINT"                                              = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"                     = (sensitive value)
          - "EVENTHUB_NAMESPACE"                                             = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                                = "on"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                                   = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                                        = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                            = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                               = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                    = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                              = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                        = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                 = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                                       = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"                             = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
          - "NODE_ENV"                                                       = "production"
          - "SERVICEBUS_NAMESPACE"                                           = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                                           = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                                = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                                              = "StagingTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"                   = "subscription-history"
          - "SUBSCRIPTION_ID"                                                = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"                             = "ts-p-itn-sr-evh-01"
          - "SubscriptionHistoryCosmosConnection__accountEndpoint"           = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "SubscriptionRequestEventHubConnection__fullyQualifiedNamespace" = "ts-p-itn-main-evhns-01.servicebus.windows.net"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          - "TRIAL_CONSUMER"                                                 = "on"
          - "TrialsCosmosConnection__accountEndpoint"                        = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                = "1"
          - "WEBSITE_DNS_SERVER"                                             = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                       = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"             = "activations"
          - "ACTIVATION_CONSUMER"                             = "off"
          - "ACTIVATION_MAX_FETCH_SIZE"                       = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "COSMOSDB_DATABASE_NAME"                          = "db"
          - "COSMOSDB_ENDPOINT"                               = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EVENTHUB_NAMESPACE"                              = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                 = "off"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                    = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
          - "NODE_ENV"                                        = "production"
          - "SERVICEBUS_NAMESPACE"                            = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                            = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                 = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                   = "off"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"    = "subscription-history"
          - "SUBSCRIPTION_ID"                                 = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                   = "off"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"              = "ts-p-itn-sr-evh-01"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          - "TRIAL_CONSUMER"                                  = "off"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

      ~ site_config {
          ~ ip_restriction_default_action           = "Deny" -> "Allow"
            # (26 unchanged attributes hidden)

          - ip_restriction {
              - action     = "Allow" -> null
              - headers    = [] -> null
              - ip_address = "100.100.0.0/32" -> null
              - name       = "test" -> null
              - priority   = 100 -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"             = "activations"
          - "ACTIVATION_CONSUMER"                             = "off"
          - "ACTIVATION_MAX_FETCH_SIZE"                       = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "COSMOSDB_DATABASE_NAME"                          = "db"
          - "COSMOSDB_ENDPOINT"                               = "https://ts-p-itn-cosno-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EVENTHUB_NAMESPACE"                              = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                 = "off"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                    = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
          - "NODE_ENV"                                        = "production"
          - "SERVICEBUS_NAMESPACE"                            = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                            = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                 = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                   = "off"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"    = "subscription-history"
          - "SUBSCRIPTION_ID"                                 = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                   = "off"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"              = "ts-p-itn-sr-evh-01"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          - "TRIAL_CONSUMER"                                  = "off"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 23 to add, 5 to change, 18 to destroy.

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 16 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
